window.GG = {};

GG.DEFAULT_GAMETIME = 20;//默认游戏时长
GG.DEFAULT_GAMESCORE =20;//题目数
GG.COLOR_ARR = ["红","黄","蓝","黑","绿"];
GG.COLOR_NUM = {
    "红":"ff0000",
    "黄":"ffff00",
    "蓝":"0000ff",
    "黑":"000000",
    "绿":"00ff00",
};
GG.DES_LEVEL0 = ["你都没点击按钮吗？","你肯定是故意的吧！","0分还是很少见的","天才","牛逼","氪金得高分吧"];
GG.DES_LEVEL1 = ["你好菜啊！","我建议你再来一次","少年，打篮球吗？","再接再厉吧","可能需要再来一次","看好了再选吧","要睁大眼睛看哦","你是caixukun吧！","充值还能更强哦"];
GG.DES_LEVEL2 = ["看样子还行","你可以更厉害的","你已经超过很多菜鸟了","哎哟，不错哦","你开挂了吧","掌声在哪里","充值还能更强哦"];
GG.DES_LEVEL3 = ["你为何如此优秀","一枝独秀","还敢再来一次吗！","眼睛花了吧，不过你很棒棒啊","应该没人超过你了吧","天才","请接受我的膜拜","充值还能更强哦"];
GG.DES_LEVEL4 = ["人民币战士","阁下一定是土豪","佩服","人生如戏，全靠充值","无人能及"];

GG.CHARGEOK = function(){
    cc.log("充值成功");
};
